Wind_Dune_Egmond/run_angle10/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    //- Define inlet conditions
    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    /*motorBikeGroup
    {
        type            kqRWallFunction;
        value           $internalField;
    }*/
	
	front    // mesle inlet ast
	{
    
	type            cyclic;
	
	//type slip;     
	
	/*type  fixedValue;
    value $internalField;*/
		
	}

	Back        
	{
    
	type            cyclic;
	
	//type slip;
	
	/*type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;*/
	
	}

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
